Autodesk.Revit.DB.PointClouds.IPointSetIterator.ReadPoints(System.IntPtr,System.Int32)
Implement this method to fill the provided buffer with points up to the number of maximum points for
which the buffer was allocated.
buffer:
Memory buffer into which the points should be written. The buffer was allocated
by Revit and it is guaranteed to be valid for the duration of the call.
bufferSize:
The maximum number of CloudPoint objects that may be copied into the buffer.
Returns:
The actual number of CloudPoint objects placed in the buffer (can be less than the
length of the buffer).  If there are no more points available, return 0.
Since:
2012

Autodesk.Revit.DB.PointClouds.IPointSetIterator.Free
Use this method to discard any resources consumed by the iterator.  Revit will call it when done using the iterator.
Since:
2012

Autodesk.Revit.DB.PointClouds.IPointSetIterator
An interface that Revit will call when iterating through sets of points on the engine.
Remarks:
An instance of this interface is obtained from the Point Cloud
engine when the engine's CreatePointSetIterator method is called.
Since:
2012